БухЭксп/InformationRegisters/CW_НачалоВеденияОперативногоУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_НачалоВеденияОперативногоУчета</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачалаВеденияУчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперативнойЗадолженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВидыОперативнойЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_НачалоВеденияОперативногоУчета/Forms/ФормаЗаписиУправляемая/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустой() Тогда
		Запись.ДатаНачалаВеденияУчета = ТекущаяДата();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЭтотОбъект.Параметры.Ключ.Пустой() 
		и ОперативныйУчетВедется(Запись.Организация, Запись.ВидОперативнойЗадолженности) Тогда
		ПоказатьПредупреждение(,"По организации "+СокрЛП(Запись.Организация)+ ", дата начала ведения оперативного учета по виду задолженности "+СокрЛП(Запись.ВидОперативнойЗадолженности)+" уже уже установлена!");	
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры 

&НаСервереБезконтекста
Функция ОперативныйУчетВедется(Знач Организация, Знач ВидЗадолженности)
	
	//По каждой организации, по кажддому виду задолженности можетбыть только одна запись!
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_НачалоВеденияОперативногоУчета.Организация КАК Организация,
	               |	CW_НачалоВеденияОперативногоУчета.ВидОперативнойЗадолженности КАК ВидОперативнойЗадолженности
	               |ИЗ
	               |	РегистрСведений.CW_НачалоВеденияОперативногоУчета КАК CW_НачалоВеденияОперативногоУчета
	               |ГДЕ
	               |	CW_НачалоВеденияОперативногоУчета.Организация = &Организация
	               |	И CW_НачалоВеденияОперативногоУчета.ВидОперативнойЗадолженности = &ВидЗадолженности";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ВидЗадолженности", ВидЗадолженности);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции
